RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_qeiv2_regs.h
/*
 * DIRCHGFEN (RW)
 *
 */
#define QEIV2_TRGOEN_DIRCHGFEN_MASK (0x1000000UL)
#define QEIV2_TRGOEN_DIRCHGFEN_SHIFT (24U)
#define QEIV2_TRGOEN_DIRCHGFEN_SET(x) (((uint32_t)(x) << QEIV2_TRGOEN_DIRCHGFEN_SHIFT) & QEIV2_TRGOEN_DIRCHGFEN_MASK)
#define QEIV2_TRGOEN_DIRCHGFEN_GET(x) (((uint32_t)(x) & QEIV2_TRGOEN_DIRCHGFEN_MASK) >> QEIV2_TRGOEN_DIRCHGFEN_SHIFT)

/*
 * CYCLE0FEN (RW)
 *
 */
#define QEIV2_TRGOEN_CYCLE0FEN_MASK (0x800000UL)
#define QEIV2_TRGOEN_CYCLE0FEN_SHIFT (23U)
#define QEIV2_TRGOEN_CYCLE0FEN_SET(x) (((uint32_t)(x) << QEIV2_TRGOEN_CYCLE0FEN_SHIFT) & QEIV2_TRGOEN_CYCLE0FEN_MASK)
#define QEIV2_TRGOEN_CYCLE0FEN_GET(x) (((uint32_t)(x) & QEIV2_TRGOEN_CYCLE0FEN_MASK) >> QEIV2_TRGOEN_CYCLE0FEN_SHIFT)

/*
 * CYCLE1FEN (RW)
 *
 */
#define QEIV2_TRGOEN_CYCLE1FEN_MASK (0x400000UL)
#define QEIV2_TRGOEN_CYCLE1FEN_SHIFT (22U)
#define QEIV2_TRGOEN_CYCLE1FEN_SET(x) (((uint32_t)(x) << QEIV2_TRGOEN_CYCLE1FEN_SHIFT) & QEIV2_TRGOEN_CYCLE1FEN_MASK)
#define QEIV2_TRGOEN_CYCLE1FEN_GET(x) (((uint32_t)(x) & QEIV2_TRGOEN_CYCLE1FEN_MASK) >> QEIV2_TRGOEN_CYCLE1FEN_SHIFT)

/*
 * PULSE0FEN (RW)
 *
 */
#define QEIV2_TRGOEN_PULSE0FEN_MASK (0x200000UL)
#define QEIV2_TRGOEN_PULSE0FEN_SHIFT (21U)
#define QEIV2_TRGOEN_PULSE0FEN_SET(x) (((uint32_t)(x) << QEIV2_TRGOEN_PULSE0FEN_SHIFT) & QEIV2_TRGOEN_PULSE0FEN_MASK)
#define QEIV2_TRGOEN_PULSE0FEN_GET(x) (((uint32_t)(x) & QEIV2_TRGOEN_PULSE0FEN_MASK) >> QEIV2_TRGOEN_PULSE0FEN_SHIFT)

/*
 * PULSE1FEN (RW)
 *
 */
#define QEIV2_TRGOEN_PULSE1FEN_MASK (0x100000UL)
#define QEIV2_TRGOEN_PULSE1FEN_SHIFT (20U)
#define QEIV2_TRGOEN_PULSE1FEN_SET(x) (((uint32_t)(x) << QEIV2_TRGOEN_PULSE1FEN_SHIFT) & QEIV2_TRGOEN_PULSE1FEN_MASK)
#define QEIV2_TRGOEN_PULSE1FEN_GET(x) (((uint32_t)(x) & QEIV2_TRGOEN_PULSE1FEN_MASK) >> QEIV2_TRGOEN_PULSE1FEN_SHIFT)

/*
 * HOME2FEN (RW)
 *
 */
#define QEIV2_TRGOEN_HOME2FEN_MASK (0x80000UL)
#define QEIV2_TRGOEN_HOME2FEN_SHIFT (19U)
#define QEIV2_TRGOEN_HOME2FEN_SET(x) (((uint32_t)(x) << QEIV2_TRGOEN_HOME2FEN_SHIFT) & QEIV2_TRGOEN_HOME2FEN_MASK)
#define QEIV2_TRGOEN_HOME2FEN_GET(x) (((uint32_t)(x) & QEIV2_TRGOEN_HOME2FEN_MASK) >> QEIV2_TRGOEN_HOME2FEN_SHIFT)

/*
 * FAULTFEN (RW)
 *
 */
#define QEIV2_TRGOEN_FAULTFEN_MASK (0x40000UL)
#define QEIV2_TRGOEN_FAULTFEN_SHIFT (18U)
#define QEIV2_TRGOEN_FAULTFEN_SET(x) (((uint32_t)(x) << QEIV2_TRGOEN_FAULTFEN_SHIFT) & QEIV2_TRGOEN_FAULTFEN_MASK)
#define QEIV2_TRGOEN_FAULTFEN_GET(x) (((uint32_t)(x) & QEIV2_TRGOEN_FAULTFEN_MASK) >> QEIV2_TRGOEN_FAULTFEN_SHIFT)

/* Bitfield definition for register: READEN */
/*
 * WDGFEN (RW)
 *
 * 1- load counters to their read registers when wdg flag set
 */
#define QEIV2_READEN_WDGFEN_MASK (0x80000000UL)
#define QEIV2_READEN_WDGFEN_SHIFT (31U)
#define QEIV2_READEN_WDGFEN_SET(x) (((uint32_t)(x) << QEIV2_READEN_WDGFEN_SHIFT) & QEIV2_READEN_WDGFEN_MASK)
#define QEIV2_READEN_WDGFEN_GET(x) (((uint32_t)(x) & QEIV2_READEN_WDGFEN_MASK) >> QEIV2_READEN_WDGFEN_SHIFT)

/*
 * HOMEFEN (RW)
 *
 * 1- load counters to their read registers when homef flag set
 */
#define QEIV2_READEN_HOMEFEN_MASK (0x40000000UL)
#define QEIV2_READEN_HOMEFEN_SHIFT (30U)
#define QEIV2_READEN_HOMEFEN_SET(x) (((uint32_t)(x) << QEIV2_READEN_HOMEFEN_SHIFT) & QEIV2_READEN_HOMEFEN_MASK)
#define QEIV2_READEN_HOMEFEN_GET(x) (((uint32_t)(x) & QEIV2_READEN_HOMEFEN_MASK) >> QEIV2_READEN_HOMEFEN_SHIFT)

/*
 * POSCMPFEN (RW)
 *
 * 1- load counters to their read registers when poscmpf flag set
 */
#define QEIV2_READEN_POSCMPFEN_MASK (0x20000000UL)
#define QEIV2_READEN_POSCMPFEN_SHIFT (29U)
#define QEIV2_READEN_POSCMPFEN_SET(x) (((uint32_t)(x) << QEIV2_READEN_POSCMPFEN_SHIFT) & QEIV2_READEN_POSCMPFEN_MASK)
#define QEIV2_READEN_POSCMPFEN_GET(x) (((uint32_t)(x) & QEIV2_READEN_POSCMPFEN_MASK) >> QEIV2_READEN_POSCMPFEN_SHIFT)

/*
 * ZPHFEN (RW)
 *
 * 1- load counters to their read registers when zphf flag set
 */
#define QEIV2_READEN_ZPHFEN_MASK (0x10000000UL)
#define QEIV2_READEN_ZPHFEN_SHIFT (28U)
#define QEIV2_READEN_ZPHFEN_SET(x) (((uint32_t)(x) << QEIV2_READEN_ZPHFEN_SHIFT) & QEIV2_READEN_ZPHFEN_MASK)
#define QEIV2_READEN_ZPHFEN_GET(x) (((uint32_t)(x) & QEIV2_READEN_ZPHFEN_MASK) >> QEIV2_READEN_ZPHFEN_SHIFT)

/*
 * ZMISSFEN (RW)
 *
 */
#define QEIV2_READEN_ZMISSFEN_MASK (0x8000000UL)
#define QEIV2_READEN_ZMISSFEN_SHIFT (27U)
#define QEIV2_READEN_ZMISSFEN_SET(x) (((uint32_t)(x) << QEIV2_READEN_ZMISSFEN_SHIFT) & QEIV2_READEN_ZMISSFEN_MASK)
#define QEIV2_READEN_ZMISSFEN_GET(x) (((uint32_t)(x) & QEIV2_READEN_ZMISSFEN_MASK) >> QEIV2_READEN_ZMISSFEN_SHIFT)

/*
 * WIDTHTMFEN (RW)
 *
 */
#define QEIV2_READEN_WIDTHTMFEN_MASK (0x4000000UL)
#define QEIV2_READEN_WIDTHTMFEN_SHIFT (26U)
#define QEIV2_READEN_WIDTHTMFEN_SET(x) (((uint32_t)(x) << QEIV2_READEN_WIDTHTMFEN_SHIFT) & QEIV2_READEN_WIDTHTMFEN_MASK)
#define QEIV2_READEN_WIDTHTMFEN_GET(x) (((uint32_t)(x) & QEIV2_READEN_WIDTHTMFEN_MASK) >> QEIV2_READEN_WIDTHTMFEN_SHIFT)

/*
 * POS2CMPFEN (RW)
 *
 */
#define QEIV2_READEN_POS2CMPFEN_MASK (0x2000000UL)
#define QEIV2_READEN_POS2CMPFEN_SHIFT (25U)
#define QEIV2_READEN_POS2CMPFEN_SET(x) (((uint32_t)(x) << QEIV2_READEN_POS2CMPFEN_SHIFT) & QEIV2_READEN_POS2CMPFEN_MASK)
#define QEIV2_READEN_POS2CMPFEN_GET(x) (((uint32_t)(x) & QEIV2_READEN_POS2CMPFEN_MASK) >> QEIV2_READEN_POS2CMPFEN_SHIFT)

/*
 * DIRCHGFEN (RW)
 *
 */
#define QEIV2_READEN_DIRCHGFEN_MASK (0x1000000UL)
#define QEIV2_READEN_DIRCHGFEN_SHIFT (24U)
#define QEIV2_READEN_DIRCHGFEN_SET(x) (((uint32_t)(x) << QEIV2_READEN_DIRCHGFEN_SHIFT) & QEIV2_READEN_DIRCHGFEN_MASK)
#define QEIV2_READEN_DIRCHGFEN_GET(x) (((uint32_t)(x) & QEIV2_READEN_DIRCHGFEN_MASK) >> QEIV2_READEN_DIRCHGFEN_SHIFT)

/*
 * CYCLE0FEN (RW)
 *
 */
#define QEIV2_READEN_CYCLE0FEN_MASK (0x800000UL)
#define QEIV2_READEN_CYCLE0FEN_SHIFT (23U)
#define QEIV2_READEN_CYCLE0FEN_SET(x) (((uint32_t)(x) << QEIV2_READEN_CYCLE0FEN_SHIFT) & QEIV2_READEN_CYCLE0FEN_MASK)
#define QEIV2_READEN_CYCLE0FEN_GET(x) (((uint32_t)(x) & QEIV2_READEN_CYCLE0FEN_MASK) >> QEIV2_READEN_CYCLE0FEN_SHIFT)

/*
 * CYCLE1FEN (RW)
 *
 */
#define QEIV2_READEN_CYCLE1FEN_MASK (0x400000UL)
#define QEIV2_READEN_CYCLE1FEN_SHIFT (22U)
#define QEIV2_READEN_CYCLE1FEN_SET(x) (((uint32_t)(x) << QEIV2_READEN_CYCLE1FEN_SHIFT) & QEIV2_READEN_CYCLE1FEN_MASK)
#define QEIV2_READEN_CYCLE1FEN_GET(x) (((uint32_t)(x) & QEIV2_READEN_CYCLE1FEN_MASK) >> QEIV2_READEN_CYCLE1FEN_SHIFT)

